Revit 2027 API
ParameterTypeId.ViewerSheetNumber Property
 "Sheet Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewerSheetNumber { get; }
Public Shared ReadOnly Property ViewerSheetNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewerSheetNumber {
	ForgeTypeId^ get ();
}
static member ViewerSheetNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace